# Глава 04 — Упражнение 1
# Напишите функцию get_discount(experience):
# - стаж 0-2 лет → скидка 0%
# - стаж 3-5 лет → скидка 5%
# - стаж 6-10 лет → скидка 10%
# - стаж > 10 лет → скидка 15%
# Выведите скидки для стажа 1, 4, 8, 15 лет

def get_discount(experience):
    pass  # замените на ваш код

# Тесты
print(get_discount(1))   # 0
print(get_discount(4))   # 5
print(get_discount(8))   # 10
print(get_discount(15))  # 15
